{
  "template_title": "The Ultimate Template",
  "template_description": "Batteries included React template that supercharges your development.",
  "home": "Home",
  "features": "Features",
  "about": "About",
  "documentation": "Documentation",
  "React": "A JavaScript library for building rich user interfaces",
  "esbuild": "A blazing fast JavaScript bundler with rich customizations",
  "TailwindCSS": "A utility-first CSS framework to build modern websites",
  "ESLint": "A JavaScript static analyzer that detects problems quickly",
  "Prettier": "An opinionated code formatter that supports many languages",
  "Jest": "A powerful JavaScript testing framework that focuses on simplicity",
  "TypeScript": "Strongly typed programming language for JavaScript",
  "Framer Motion": "A rich and extensive motion library for React",
  "i18next": "An excellent internationalization framework for JavaScript",
  "React Icons": "Opulent icon library for React from popular sources",
  "Zod": "TypeScript-first schema validation with static type inference",
  "panel_disclaimer": "This component serves as a quicklinks to the devtools used within the template. Feel free to delete this component if you don't need it or after your development.",
  "feature_react": "The latest React is used while setting up this template. Expect all the latest React features with low level configs available.",
  "feature_routing": "Configurations for client side routing with <code>react-router-dom</code> has already been setup. The implementation is located in <code>App.tsx</code>.",
  "feature_bundler": "The bundler used for this template is esbuild, which is a blazingly fast JavaScript bundler that has a lot of customizations available.",
  "feature_tailwind": "The latest TailwindCSS v3 that has a lot more features and class utilities had been included as well.",
  "feature_formatter": "Prettier is used as the formatter for the project. Rules can be modified in <code>.prettierrc.yml</code> file. Run <code>pnpm format .</code> to format the codebase.",
  "feature_linter": "ESLint is used as the linter to provide clean and standardized codes along with good practices that enhance the readability and maintainability of the code. Run <code>pnpm lint</code> to perform linting.",
  "feature_dv": "Zod has been used for data validation for user inputs. The user provided value can be verified before using it in the application.",
  "feature_i18n": "Internationalization for the project has been setup with i18next and the sample translation are provided in Japanese. The language switching component is also provided for convenience.",
  "feature_dark": "Dark mode has already been setup via TailwindCSS. The theme switcher component is provided for convenience and the mode of choice will persist through local storage.",
  "feature_unit": "Jest with <code>@testing-library/react</code> has been configured along with TypeScript. The integrations worked flawlessly.",
  "feature_e2e": "Playwright is included in the template for fast and cross browser end-to-end tests. The configuration is located at <code>playwright.config.ts</code>. Run e2e test by <code>pnpm \"test\":e2e</code>.",
  "feature_animation": "Framer motion is also installed in the template to provide powerful, smooth and fluid animation to the DOM elements.",
  "feature_icon": "<code>react-icons</code> is installed to provide SVG icons of various sources all inside one place."
}
